Repository: RaphaelLesourd/RateLimitForCodex
Catalog: Codex rate limit/Localizable.xcstrings
Source language: en
Languages: fr

# auth.api_key.manage
source: Manage API keys
fr: Gérer les clés API

# auth.api_key.placeholder
source: OpenAI API key
fr: Clé API OpenAI

# auth.data_source
source: Data Source
fr: Source des données

# auth.experimental.notice
source: Experimental mode reads local session files from ~/.codex/sessions. This path is not an official OpenAI API integration.
fr: Le mode expérimental lit les fichiers de session locaux dans ~/.codex/sessions. Ce chemin n'est pas une intégration officielle de l'API OpenAI.

# auth.mode.api_key
source: API Key
fr: Clé API

# auth.mode.codex_session
source: Codex Session
fr: Session Codex

# auth.official.label
source: Official OpenAI API key
fr: Clé API OpenAI officielle

# auto_refresh.cost_format
source: Cost %@t%@
fr: Coût %@t%@

# auto_refresh.last_check_format
source: Last check %@
fr: Dernière vérification %@

# auto_refresh.title
source: Auto Refresh
fr: Actualisation automatique

# common.button.about
source: About
fr: À propos

# common.button.done
source: Done
fr: Terminé

# common.button.quit
source: Quit
fr: Quitter

# common.button.reload_now
source: Reload now
fr: Actualiser

# main_menu.about.app_name_fallback
source: Rate Limit Monitor
fr: Moniteur de limite de débit

# main_menu.about.created_with_codex
source: Created with Codex.
fr: Créé avec Codex.

# main_menu.about.disclaimer
source: ⚠️ Not affiliated with OpenAI.
fr: ⚠️ Non affilié à OpenAI.

# main_menu.about.support
source: Support
fr: Assistance

# main_menu.metric.request_reset
source: Request reset
fr: Réinitialisation des requêtes

# main_menu.metric.requests
source: Requests
fr: Requêtes

# main_menu.metric.token_reset
source: Token reset
fr: Réinitialisation des jetons

# main_menu.metric.tokens
source: Tokens
fr: Jetons

# main_menu.no_data.api
source: No API rate limit data yet.
fr: Aucune donnée de limite de débit API pour l'instant.

# main_menu.no_data.local_session
source: No local session rate-limit data yet.
fr: Aucune donnée locale de limite de débit de session pour l'instant.

# main_menu.open_at_login
source: Open at login
fr: Ouvrir à la connexion

# progress.primary_window_fallback
source: Primary window
fr: Fenêtre principale

# progress.reset.at_format
source: Reset at %@
fr: Réinitialisation à %@

# progress.reset.none
source: Reset --
fr: Réinitialisation --

# progress.reset.on_format
source: Reset on %@
fr: Réinitialisation le %@

# progress.row.used_format
source: %@: %@%% used
fr: %@: %@%% utilisé

# progress.secondary_window_fallback
source: Secondary window
fr: Fenêtre secondaire

# progress.window.hour_format
source: %@-hour window
fr: Fenêtre de %@ heures

# progress.window.minute_format
source: %@-minute window
fr: Fenêtre de %@ minutes

# progress.window.weekly
source: Weekly window
fr: Fenêtre hebdomadaire

# service.codex_sessions.folder_not_found
source: No local Codex sessions folder was found.
fr: Aucun dossier de sessions Codex local n'a été trouvé.

# service.codex_sessions.no_data
source: No local session rate-limit data found yet.
fr: Aucune donnée locale de limite de débit de session trouvée pour l'instant.

# service.openai.invalid_response
source: Received an invalid response from OpenAI.
fr: Réponse OpenAI invalide.

# service.openai.request_failed_body_format
source: OpenAI request failed (%@): %@
fr: La requête OpenAI a échoué (%@) : %@

# service.openai.request_failed_status_format
source: OpenAI request failed (%@).
fr: La requête OpenAI a échoué (%@).

# vm.error.add_api_key
source: Add an OpenAI API key.
fr: Ajoutez une clé API OpenAI.

# vm.error.incorrect_api_key
source: Incorrect API key. Paste a valid OpenAI API key.
fr: Clé API incorrecte. Collez une clé API OpenAI valide.

# vm.error.launch_at_login_approval
source: Open at login needs approval in System Settings > General > Login Items.
fr: L'option Ouvrir à la connexion nécessite une approbation dans Réglages Système > Général > Ouverture à la connexion.

# vm.error.launch_at_login_update_format
source: Could not update Open at login: %@
fr: Impossible de mettre à jour Ouvrir à la connexion : %@

# vm.error.model_empty
source: Model cannot be empty.
fr: Le modèle ne peut pas être vide.

# vm.status.last_attempt_format
source: Last attempt %@
fr: Dernière tentative %@

# vm.status.last_checked_format
source: Last checked %@
fr: Dernière vérification %@

# vm.status.local_attempt_format
source: Local session attempt %@
fr: Tentative de session locale %@

# vm.status.local_checked_format
source: Local session checked %@
fr: Session locale vérifiée %@

# vm.status.not_refreshed
source: Not refreshed yet
fr: Pas encore actualisé

# vm.status.waiting_api_key
source: Waiting for API key
fr: En attente de la clé API
